<a href="https://colab.research.google.com/github/Elwing-Chou/tibaml0922/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/tibaml0922/raw/main/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/tibaml0922/raw/main/test.csv"
urlretrieve(url, "test.csv")

('test.csv', <http.client.HTTPMessage at 0x7f52a86a0b10>)

In [4]:
import pandas as pd
data = pd.read_csv("train.csv", encoding="utf-8")
predict = pd.read_csv("test.csv", encoding="utf-8")

In [5]:
predict

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [ ]:
df = pd.concat([data, predict],
                axis=0,
                ignore_index=True)
df = df.drop(["PassengerId", "Survived"],
             axis=1)
df

In [22]:
def cabin(c):
    if not pd.isna(c):
        return c[0]
    else:
        return None
df["Cabin"] = df["Cabin"].apply(cabin)
df

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...  None         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...     C         C
2          3                             Heikkinen, Miss. Laina  ...  None         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...     C         S
4          3                           Allen, Mr. William Henry  ...  None         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...  None         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...     C         C
1306       3                       Saether, Mr. Simon Sivertsen  ...  None         S
1307       3                                Ware, Mr. Frederick  ...  None         S
1308       3                           Peter, Master. Michael J  ...  None         C

[1309 rows x 10 columns]

In [19]:
nasum = df.isna().sum()
# 篩選: Series[跟你資料筆數一樣多的T/F]
nasum[nasum > 0].sort_values(ascending=False)

Cabin       1014
Age          263
Embarked       2
Fare           1
dtype: int64

In [20]:
df.median()

Pclass     3.0000
Age       28.0000
SibSp      0.0000
Parch      0.0000
Fare      14.4542
dtype: float64